witalis3/UA3REO-DDC-Transceiver/STM32/WOLF-2/Src/front_unit.c
		if (CurrentVFO->FM_SQL_threshold_dbm > 0) {
			CurrentVFO->FM_SQL_threshold_dbm = 0;
		}
		if (CurrentVFO->FM_SQL_threshold_dbm < -126) {
			CurrentVFO->FM_SQL_threshold_dbm = -126;
		}

		int8_t band = getBandFromFreq(CurrentVFO->Freq, true);
		if (band >= 0) {
			TRX.BANDS_SAVED_SETTINGS[band].FM_SQL_threshold_dbm = CurrentVFO->FM_SQL_threshold_dbm;
		}

		LCD_UpdateQuery.StatusInfoBarRedraw = true;
	}
	
	if (TRX.ENC2_func_mode == ENC_FUNC_SET_MEM) { // mem channels select
		int8_t currentMemIndex = 0;
		for (uint8_t i = 0; i < MEMORY_CHANNELS_COUNT; i++) {
			if (CurrentVFO->Freq == CALIBRATE.MEMORY_CHANNELS[i].Freq) {
				currentMemIndex = i;
			}
		}
		
		currentMemIndex += direction * 1;
		if (currentMemIndex < 0 ) currentMemIndex = MEMORY_CHANNELS_COUNT - 1;
		if (currentMemIndex >= MEMORY_CHANNELS_COUNT ) currentMemIndex = 0;
		
		while (CALIBRATE.MEMORY_CHANNELS[currentMemIndex].Freq == 0 && currentMemIndex < MEMORY_CHANNELS_COUNT  && currentMemIndex > 0) {
			currentMemIndex += direction * 1;
		}
		
		if (currentMemIndex < 0 ) currentMemIndex = 0;
		if (currentMemIndex >= MEMORY_CHANNELS_COUNT ) currentMemIndex = 0;
		
		BUTTONHANDLER_SelectMemoryChannels(currentMemIndex);
	}
}

static void FRONTPANEL_ENC2SW_click_handler(uint32_t parameter) {
	TRX_Inactive_Time = 0;
	// ENC2 CLICK
	if (!LCD_systemMenuOpened && !LCD_window.opened) {
		TRX.ENC2_func_mode++; // enc2 rotary mode

		if (TRX.ENC2_func_mode == ENC_FUNC_PAGER) { // pager disabled
			TRX.ENC2_func_mode++;
		}
		if (TRX.ENC2_func_mode == ENC_FUNC_SET_WPM && CurrentVFO->Mode != TRX_MODE_CW) { // no WPM if not CW
			TRX.ENC2_func_mode++;
		}
		if (TRX.ENC2_func_mode == ENC_FUNC_SET_RIT && ((!TRX.RIT_Enabled && !TRX.XIT_Enabled) || !TRX.FineRITTune)) { // nothing to RIT tune
			TRX.ENC2_func_mode++;
		}
		if (TRX.ENC2_func_mode == ENC_FUNC_SET_NOTCH && !CurrentVFO->ManualNotchFilter) { // nothing to NOTCH tune
			TRX.ENC2_func_mode++;
		}
		if (TRX.ENC2_func_mode == ENC_FUNC_SET_LPF) { // unsupported
			TRX.ENC2_func_mode++;
		}
		if (TRX.ENC2_func_mode == ENC_FUNC_SET_HPF) { // unsupported
			TRX.ENC2_func_mode++;
		}
		if (TRX.ENC2_func_mode == ENC_FUNC_SET_SQL && ((CurrentVFO->Mode != TRX_MODE_NFM && CurrentVFO->Mode != TRX_MODE_WFM) || !CurrentVFO->SQL)) { // nothing to SQL tune
			TRX.ENC2_func_mode++;
		}
		if (TRX.ENC2_func_mode == ENC_FUNC_SET_VOLUME) { // af adjust disabled
			TRX.ENC2_func_mode++;
		}
		if (TRX.ENC2_func_mode == ENC_FUNC_SET_IF) { // if adjust disabled
			TRX.ENC2_func_mode++;
		}
		if (TRX.ENC2_func_mode == ENC_FUNC_SET_MEM) { // mem channels adjust
			bool has_mem_channels = false;
			for (uint8_t i = 0; i < MEMORY_CHANNELS_COUNT; i++) {
				if (CALIBRATE.MEMORY_CHANNELS[i].Freq > 0) {
					has_mem_channels = true;
				}
			}
			if (!has_mem_channels) {
				TRX.ENC2_func_mode++;
			}
		}

		if (TRX.ENC2_func_mode > ENC_FUNC_SET_MEM) {
			TRX.ENC2_func_mode = ENC_FUNC_FAST_STEP;
		}

		if (TRX.ENC2_func_mode == ENC_FUNC_FAST_STEP) {
			LCD_showTooltip("FAST STEP");
		}
		if (TRX.ENC2_func_mode == ENC_FUNC_SET_WPM) {
			LCD_showTooltip("SET WPM");
		}
		if (TRX.ENC2_func_mode == ENC_FUNC_SET_RIT) {
			LCD_showTooltip("SET RIT");
		}
		if (TRX.ENC2_func_mode == ENC_FUNC_SET_NOTCH) {
			LCD_showTooltip("SET NOTCH");
		}
		if (TRX.ENC2_func_mode == ENC_FUNC_SET_LPF) {
			LCD_showTooltip("SET LPF");
		}
		if (TRX.ENC2_func_mode == ENC_FUNC_SET_HPF) {
			LCD_showTooltip("SET HPF");
		}
		if (TRX.ENC2_func_mode == ENC_FUNC_SET_SQL) {
			LCD_showTooltip("SET SQL");
		}
		if (TRX.ENC2_func_mode == ENC_FUNC_SET_MEM) {
			LCD_showTooltip("MEM CHANNELS");
		}
	} else {
		if (LCD_systemMenuOpened) {
			// navigate in menu
			SYSMENU_eventSecEncoderClickSystemMenu();
		}
	}
}

static void FRONTPANEL_ENC2SW_hold_handler(uint32_t parameter) {
	TRX_Inactive_Time = 0;
	BUTTONHANDLER_MENU(0);
}

void FRONTPANEL_ENCODER3_checkRotate(void) {
	uint8_t ENCODER3_DTVal = HAL_GPIO_ReadPin(ENC3_DT_GPIO_Port, ENC3_DT_Pin);
	uint8_t ENCODER3_CLKVal = HAL_GPIO_ReadPin(ENC3_CLK_GPIO_Port, ENC3_CLK_Pin);

	if ((HAL_GetTick() - ENCODER3_AValDeb) < CALIBRATE.ENCODER2_DEBOUNCE) {
		return;
	}

	if (!CALIBRATE.ENCODER_ON_FALLING || ENCODER3_CLKVal == 0) {
		if (ENCODER3_DTVal != ENCODER3_CLKVal) { // If pin A changed first - clockwise rotation
			FRONTPANEL_ProcessEncoder3 = CALIBRATE.ENCODER2_INVERT ? 1 : -1;
		} else { // otherwise B changed its state first - counterclockwise rotation
			FRONTPANEL_ProcessEncoder3 = CALIBRATE.ENCODER2_INVERT ? -1 : 1;
		}
		TRX_ScanMode = false;
	}
	ENCODER3_AValDeb = HAL_GetTick();
}

static void FRONTPANEL_ENCODER3_Rotated(int8_t direction) // rotated encoder, handler here, direction -1 - left, 1 - right
{
	TRX_Inactive_Time = 0;
	if (TRX.Locked || LCD_window.opened) {
		return;
	}

	if (direction > 0 || TRX.RF_Gain > 4) {
		TRX.RF_Gain += direction * 5;
	}
	if (direction < 0 && TRX.RF_Gain <= 5) {
		TRX.RF_Gain = 0;
	}
	if (TRX.RF_Gain > 100) {
		TRX.RF_Gain = 100;
	}

	int8_t band = getBandFromFreq(CurrentVFO->RealRXFreq, true);
	if (band >= 0) {
		TRX.BANDS_SAVED_SETTINGS[band].RF_Gain = TRX.RF_Gain;
	}

	ATU_TunePowerStabilized = false;
}

static void FRONTPANEL_ENC3SW_click_handler(uint32_t parameter) {
	TRX_Inactive_Time = 0;
	if (TRX.Locked || LCD_window.opened) {
		return;
	}
}

static void FRONTPANEL_ENC3SW_hold_handler(uint32_t parameter) {
	TRX_Inactive_Time = 0;
	if (TRX.Locked || LCD_window.opened) {
		return;
	}
}

void FRONTPANEL_ENCODER4_checkRotate(void) {
	uint8_t ENCODER4_DTVal = HAL_GPIO_ReadPin(ENC4_DT_GPIO_Port, ENC4_DT_Pin);
	uint8_t ENCODER4_CLKVal = HAL_GPIO_ReadPin(ENC4_CLK_GPIO_Port, ENC4_CLK_Pin);

	if ((HAL_GetTick() - ENCODER4_AValDeb) < CALIBRATE.ENCODER2_DEBOUNCE) {
		return;
	}

	if (!CALIBRATE.ENCODER_ON_FALLING || ENCODER4_CLKVal == 0) {
		if (ENCODER4_DTVal != ENCODER4_CLKVal) { // If pin A changed first - clockwise rotation
			FRONTPANEL_ProcessEncoder4 = CALIBRATE.ENCODER2_INVERT ? 1 : -1;
		} else { // otherwise B changed its state first - counterclockwise rotation
			FRONTPANEL_ProcessEncoder4 = CALIBRATE.ENCODER2_INVERT ? -1 : 1;
		}
		TRX_ScanMode = false;
	}
	ENCODER4_AValDeb = HAL_GetTick();
}

static void FRONTPANEL_ENCODER4_Rotated(int8_t direction) // rotated encoder, handler here, direction -1 - left, 1 - right
{
	TRX_Inactive_Time = 0;
	if (TRX.Locked || LCD_window.opened) {
		return;
	}

	// LPF
	if (PERIPH_FrontPanel_Buttons[0].state == false) { // enc4_sw button
		if (!TRX_on_TX) {
			if (CurrentVFO->Mode == TRX_MODE_CW) {
				SYSMENU_HANDL_FILTER_CW_LPF_pass(direction);
			}
			if (CurrentVFO->Mode == TRX_MODE_LSB || CurrentVFO->Mode == TRX_MODE_USB || CurrentVFO->Mode == TRX_MODE_DIGI_U || CurrentVFO->Mode == TRX_MODE_RTTY) {
				SYSMENU_HANDL_FILTER_SSB_LPF_RX_pass(direction);
			}
			if (CurrentVFO->Mode == TRX_MODE_AM || CurrentVFO->Mode == TRX_MODE_SAM) {
				SYSMENU_HANDL_FILTER_AM_LPF_RX_pass(direction);
			}
			if (CurrentVFO->Mode == TRX_MODE_NFM) {
				SYSMENU_HANDL_FILTER_FM_LPF_RX_pass(direction);
			}
			if (CurrentVFO->Mode == TRX_MODE_DIGI_L) {
				SYSMENU_HANDL_FILTER_DIGI_LPF_pass(direction);
			}
		} else {
			if (CurrentVFO->Mode == TRX_MODE_CW) {
				SYSMENU_HANDL_FILTER_CW_LPF_pass(direction);
			}
			if (CurrentVFO->Mode == TRX_MODE_LSB || CurrentVFO->Mode == TRX_MODE_USB || CurrentVFO->Mode == TRX_MODE_DIGI_U || CurrentVFO->Mode == TRX_MODE_RTTY) {
				SYSMENU_HANDL_FILTER_SSB_LPF_TX_pass(direction);
			}
			if (CurrentVFO->Mode == TRX_MODE_AM || CurrentVFO->Mode == TRX_MODE_SAM) {
				SYSMENU_HANDL_FILTER_AM_LPF_TX_pass(direction);
			}
			if (CurrentVFO->Mode == TRX_MODE_NFM) {
				SYSMENU_HANDL_FILTER_FM_LPF_TX_pass(direction);
			}
			if (CurrentVFO->Mode == TRX_MODE_DIGI_L) {
				SYSMENU_HANDL_FILTER_DIGI_LPF_pass(direction);
			}
		}
	}

	// HPF
	if (PERIPH_FrontPanel_Buttons[0].state == true) { // enc4_sw button
		if (!TRX_on_TX) {
			if (CurrentVFO->Mode == TRX_MODE_LSB || CurrentVFO->Mode == TRX_MODE_USB || CurrentVFO->Mode == TRX_MODE_DIGI_U || CurrentVFO->Mode == TRX_MODE_RTTY) {
				SYSMENU_HANDL_FILTER_SSB_HPF_RX_pass(direction);
			}
		} else {
			if (CurrentVFO->Mode == TRX_MODE_LSB || CurrentVFO->Mode == TRX_MODE_USB || CurrentVFO->Mode == TRX_MODE_DIGI_U || CurrentVFO->Mode == TRX_MODE_RTTY) {
				SYSMENU_HANDL_FILTER_SSB_HPF_TX_pass(direction);
			}
		}
	}
}

